/**
 * 
 */
package Head;

import java.util.Scanner;

/**
 * Создайте программу ввода целых чисел как аргументов командной строки,подсчета их суммы и вывода результата на экран
 * @author User
 *
 */
public class Task5{

    /**
     * @param args
     */
    public static void main(String[] args){
        // TODO Auto-generated method stub
       //решение через создание объектов


        //long summa = 0;

       // for (int i = 0; i < 5; i++) {

             Task4CommandLineInput.readNamber();
        //}
        //System.out.println("Итого " + summa);

        /*
        // не могу решить тк не знаю как много чисел нужно суммировать
        System.out.println("Введите число ");
        Scanner sc = new Scanner(System.in);
        int i1 = 0;

        for (int i = 0; i < 6; i++) {
            i1 = i1 + sc.nextInt();

        }
        System.out.println("Сумму равна " + i1);
        */
    }

}
